#include "sql_connect.h"

void MENU::Menu1() {
	cout << "****************************" << endl;
	cout << "*****  1.管理员登入    *****" << endl;
	cout << "*****  2.学生登入      *****" << endl;
	cout << "****************************" << endl;
}

void MENU::Menu2() {
	cout << "********************************" << endl;
	cout << "*****  1.录入学生信息      *****" << endl;
	cout << "*****  2.录入课程信息      *****" << endl;
	cout << "*****  3.查询课程信息      *****" << endl;
	cout << "*****  4.查询学生信息      *****" << endl;
	cout << "*****  5.显示所有课程信息  *****" << endl;
	cout << "*****  6.显示所有学生信息  *****" << endl;
	cout << "*****  7.修改学生信息      *****" << endl;
	cout << "*****  8.修改课程信息      *****" << endl;
	cout << "*****  9.删除学生信息      *****" << endl;
	cout << "*****  10.删除课程信息     *****" << endl;
	cout << "*****  11.统计学生信息     *****" << endl;
	cout << "*****  12.统计课程门数     *****" << endl;
	cout << "*****  13.某门课程学生信息 *****" << endl;
	cout << "*****  14.退出登陆         *****" << endl;
	cout << "********************************" << endl;
}

void MENU:: Menu3() {
	cout << "****************************" << endl;
	cout << "*****  1.选课          *****" << endl;
	cout << "*****  2.查询已选课程  *****" << endl;
	cout << "*****  3.退出登陆      *****" << endl;
	cout << "****************************" << endl;
}

void FIR::menu1() {
	Menu1();
}

void FIR::menu2() {
	Menu2();
}

void FIR::menu3() {
	Menu3();
}
